

import pandas as pd
import matplotlib.pyplot as plt
# 모든 행을 출력하도록 설정
pd.set_option('display.max_rows', None)

# 모든 컬럼을 출력하도록 설정
pd.set_option('display.max_columns', None)



df = pd.read_csv("/home/scar/Downloads/gender.csv", encoding='cp949')


result= []
m =[]
f=[]

name = input("찾고싶은 지역의 이름을 알려주세요 : " )

for index ,row in df.iterrows():
    if  name in row[0]:
        # print(row.values)
        # for num in row.values:

        for i in row[3:104]:
            m.append(-int(i))
        for i in row[106:] :
            f.append(int (i))
        break

print(len(m), len(f))
print (m)
print(f)

plt.style.use('ggplot')
plt.figure(figsize=(10,5), dpi=300)
plt.rc('font', family='Malgun Gothic')
plt.rcParams['axes.unicode_minus'] = False
plt.title(name+'male female ')

plt.barh(range(101), m, label='male')
plt.barh(range(101), f, label='female')
plt.legend()
plt.show()



#
# plt.style.use('ggplot')
# plt.plot(result)
# plt.show()


#['행정구역', '2019년02월_계_총인구수', '2019년02월_계_연령구간인구수', '2019년02월_계_0세', '2019년02월_계_1세', '2019년02월_계_2세', '2019년02월_계_3세', '2019년02월_계_4세', '2019년02월_계_5세', '2019년02월_계_6세', '2019년02월_계_7세', '2019년02월_계_8세', '2019년02월_계_9세', '2019년02월_계_10세', '2019년02월_계_11세', '2019년02월_계_12세', '2019년02월_계_13세', '2019년02월_계_14세', '2019년02월_계_15세', '2019년02월_계_16세', '2019년02월_계_17세', '2019년02월_계_18세', '2019년02월_계_19세', '2019년02월_계_20세', '2019년02월_계_21세', '2019년02월_계_22세', '2019년02월_계_23세', '2019년02월_계_24세', '2019년02월_계_25세', '2019년02월_계_26세', '2019년02월_계_27세', '2019년02월_계_28세', '2019년02월_계_29세', '2019년02월_계_30세', '2019년02월_계_31세', '2019년02월_계_32세', '2019년02월_계_33세', '2019년02월_계_34세', '2019년02월_계_35세', '2019년02월_계_36세', '2019년02월_계_37세', '2019년02월_계_38세', '2019년02월_계_39세', '2019년02월_계_40세', '2019년02월_계_41세', '2019년02월_계_42세', '2019년02월_계_43세', '2019년02월_계_44세', '2019년02월_계_45세', '2019년02월_계_46세', '2019년02월_계_47세', '2019년02월_계_48세', '2019년02월_계_49세', '2019년02월_계_50세', '2019년02월_계_51세', '2019년02월_계_52세', '2019년02월_계_53세', '2019년02월_계_54세', '2019년02월_계_55세', '2019년02월_계_56세', '2019년02월_계_57세', '2019년02월_계_58세', '2019년02월_계_59세', '2019년02월_계_60세', '2019년02월_계_61세', '2019년02월_계_62세', '2019년02월_계_63세', '2019년02월_계_64세', '2019년02월_계_65세', '2019년02월_계_66세', '2019년02월_계_67세', '2019년02월_계_68세', '2019년02월_계_69세', '2019년02월_계_70세', '2019년02월_계_71세', '2019년02월_계_72세', '2019년02월_계_73세', '2019년02월_계_74세', '2019년02월_계_75세', '2019년02월_계_76세', '2019년02월_계_77세', '2019년02월_계_78세', '2019년02월_계_79세', '2019년02월_계_80세', '2019년02월_계_81세', '2019년02월_계_82세', '2019년02월_계_83세', '2019년02월_계_84세', '2019년02월_계_85세', '2019년02월_계_86세', '2019년02월_계_87세', '2019년02월_계_88세', '2019년02월_계_89세', '2019년02월_계_90세', '2019년02월_계_91세', '2019년02월_계_92세', '2019년02월_계_93세', '2019년02월_계_94세', '2019년02월_계_95세', '2019년02월_계_96세', '2019년02월_계_97세', '2019년02월_계_98세', '2019년02월_계_99세', '2019년02월_계_100세 이상']
